openfoam_cases/deepflame_1d_stat/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dfLowMachFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

/* maxDeltaT       1e-04; */

/* adjustTimeStep  off; */

/* writeControl    adjustableeRunTime; */

writeControl    runTime;

writeInterval   50;

/* writeInterval   30e-5; */

purgeWrite      0;

writeFormat     binary;

writePrecision    8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

/* adjustTimeStep yes; */

maxCo  0.6;

// maxDeltaT 1e-3;


// ************************************************************************* //
