openfoam_cases/deepflame_1d_stat/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0  -0.00 0.00) // 0  
    (0.05 -0.00 0.00) // 1
    (0.05  0.005 0.00) // 2
    (0.0   0.005  0.00) // 3
    (0.0   0.00  0.005) // 4
    (0.05 -0.00  0.005) // 5
    (0.05  0.005  0.005) // 6
    (0.0   0.005  0.005) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (2000 1 1) simpleGrading (1 1 1) // (170 50 50) +- ok, (170 80 80) - :D
);

edges
(
);

boundary
(
    X0
    {
        type patch;
        faces
        (
            (0 4 7 3)
            
        );
    }
    XL
    {
        type patch;
        faces
        (
            (1 2 6 5)
            
        );
    }
    border
    {
        type empty;
        faces
        (
            (4 5 6 7) // top
            (0 3 2 1)
            (0 1 5 4)
            (7 6 2 3)
            
        );
    }
    
);




// ************************************************************************* //
