openfoam_cases/deepflame_1d_stat/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    X0
    {
        
        type            waveTransmissive;
        field           p;
        pis             thermo:psi;
        gamma           1.4;
        fieldInf        1e5;
        lInf            1;
        value           $internalField;
        
        // type            fixedValue;
        // value           $internalField;
        // type advective;
        // type            zeroGradient;
    }
    XL
    {
        // type            totalPressure;
        // p0              $internalField;

        type            waveTransmissive;
        field           p;
        pis             thermo:psi;
        gamma           1.4;
        fieldInf        1e5;
        lInf            1;
        value           $internalField;

        // type            fixedValue;
        // value           $internalField;
    }
    "(border).*" {
        type empty;
        // p0  $internalField;
    }
    "(sym).*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
