openfoam_cases/deepflame_1d_stat/0.orig/C2H5OH
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C2H5OH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.09;

boundaryField
{
    X0
    {
        type            fixedValue;
        // inletValue      $internalField;
        value           $internalField;
    }
    XL
    {
        type            zeroGradient;
    }
    "(border).*"
    {
        type            empty;
    }
    "(sym).*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
