openfoam_cases/deepflame_1d_stat/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.21203; // 0.07 -- 0.21669; // 0.09 - 0.21203;

boundaryField
{
    X0
    {
        type            fixedValue;
        // inletValue      $internalField;
        value           $internalField;
    }
    XL
    {
        type            zeroGradient;
    }
    "(border).*"
    {
        type            empty;
    }
    "(sym).*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
