openfoam_cases/deepflame_1d_stat/0.orig/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    X0
    {
        type            fixedValue;
        // inletValue      $internalField;
        value           $internalField;
    }
    XL
    {
        type            zeroGradient;
    }

    "(border).*"
    {
        type            empty;
    }
    "(sym).*"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
