openfoam_cases/deepflame_1d_stat/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default          localEuler; // CrankNicolson 0.2
    //default           CrankNicolson 0.2; // CrankNicolson 0.2
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)      Gauss limitedLinearV 1;
    div(phi,Yi)         Gauss limitedLinear01 1;
    div(phi,h)          Gauss limitedLinear 1;
    div(phi,ha)          Gauss limitedLinear 1;
    div(phi,K)          Gauss limitedLinear 1;
    div(phid,p)         Gauss limitedLinear 1;
    div(phi,epsilon)    Gauss limitedLinear 1;
    div(phi,Yi_h)       Gauss limitedLinear01 1;
    div(phi,k)          Gauss limitedLinear 1;
    div(hDiffCorrFlux)             Gauss cubic;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;

    // div(phi,U)      Gauss cubic;
    // div(phi,Yi)         Gauss limitedCubic 1;
    // div(phi,h)          Gauss cubic;
    // div(phi,ha)          Gauss cubic;
    // div(phi,K)          Gauss cubic;
    // div(phid,p)         Gauss cubic;
    // div(phi,epsilon)    Gauss cubic     ;
    // div(phi,Yi_h)       Gauss limitedCubic 1;
    // div(phi,k)          Gauss cubic;
    // div(hDiffCorrFlux)             Gauss cubic;
    // div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss cubic;
}

laplacianSchemes
{
    // default         Gauss cubic orthogonal;
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    // default         cubic;
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
