openfoam_cases/deepflame_1d_stat/Allrun
# #!/bin/sh
# cd ${0%/*} || exit 1    # Run from this directory

# # Source tutorial run functions
# . $WM_PROJECT_DIR/bin/tools/RunFunctions
# cp -r 0.orig 0

# application=dfLowMachFoam

# runApplication blockMesh
# # runApplication setFields
# runApplication decomposePar
# runApplication mpirun -np 4 --allow-run-as-root $application -parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=dfLowMachFoam

cp -r 0.orig/ 0/
runApplication blockMesh
runApplication setFields
runApplication decomposePar
runApplication mpirun -np 8 --allow-run-as-root $application -parallel
